Revit 2026 API

# ViewCropRegionShapeManagerRemoveSplit Method

---

Removes any split applied to the view's crop.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSplit()
```
```vb
Public Sub RemoveSplit
```
```cpp
public:
void RemoveSplit()
```
```fsharp
member RemoveSplit : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The crop of the associated view is not permitted to have multiple regions. |

#### Reference

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace